#Написать программу, которая выводит сама себя

s='s={!r};print(s.format(s))';print(s.format(s))