# Написать программу, которая выводит саму себя задом наперед

s='s={!r};print(s.format(s))';print(s.format(s)[::-1])